Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can also specify a minimum (taskmanager.network.memory.min) and a maxi‐ mum (taskmanager.network.memory.max) amount of memory that is used for net‐
zh_cn: 你也可以指定一个用于网络缓冲区的最小（taskmanager.network.meamory.min）和最大（taskmanager.network.memory.max）内存量（二者的默认值分别是64MB和1G），从而可以为上述的相对配置加上绝对限制。

source: You can also take a savepoint of a running application via the REST call that is shown in Table 10-14 .
zh_cn: 你还可以利用表10-14中展示的REST调用为当前正在运行的应用生成一个保存点。

source: You can apply predefined options to RocksDBStateBackend as follows:
zh_cn: 你可以像下面这样为RocksDBStateBackend配置预定义选项：

source: You can call it from the root directory of a Flink setup with
zh_cn: 你可以在Flink安装根目录下通过命令./bin/flink来调用它。

source: You can change the Flink version, group and artifact IDs, version, and generated package by changing the respective parameters of the above mvn command.
zh_cn: 你可以通过改变mvn命令的相应参数来更改Flink版本、Maven的组标识符和项目标识符、项目版本以及生成的包。

source: You can check the status of the rescale request using the request ID.
zh_cn: 你可以使用请求ID检查扩缩容请求的状态。

source: You can completely disable task chaining for an application via the
zh_cn: 你可以通过StreamExecutionEnvironment来完全禁用应用内的任务链接：

source: You can configure a different port at the ./conf/flink-conf.yaml
zh_cn: 你可以通过./conf/flink-conf.yaml文件内的rest.port配置项对该端口进行修改。

source: You can configure the RollingPolicy with the withRollingPolicy() method on the builder.
zh_cn: 你可以通过调用构建器的withRollingPolicy()方法来对它进行配置。

source: You can configure the starting position from which the partitions of a topic are initially read.
zh_cn: 你可以配置主题分区开始读取数据的位置。

source: You can configure which context infor‐ mation the metric should contain by setting the corresponding metric options in the flink-conf.yaml file.
zh_cn: 你可以通过在flink-conf.yaml文件中设置对应的指标选项来配置指标所包含的上下文信息。

source: You can create a Flink deployment for Kubernetes by storing each definition in a sep‐ arate file, such as master-deployment.yaml, worker-deployment.yaml, or master- service.yaml.
zh_cn: 为了创建Flink的Kubernetes Deployment，你可以将每个定义单独存为一个文件，例如master-deployment.yaml，worker-deployment.yaml或master-service.yaml。

source: You can define breakpoints in the code and debug your application as you would normally do.
zh_cn: 如同往常一般，在代码里设置断点，开启调试。

source: You can define the default state backend of a cluster with
zh_cn: 你可以使用state.backend参数定义集群的默认状态后端。

source: You can develop and execute Flink applications on Linux, macOS, and Windows.
zh_cn: 你可以在Linux、maxOS以及Windows等常见操作系统上开发和运行Flink应用，

source: You can disable this behavior and let the application continue after a checkpointing error.
zh_cn: 你可以禁用此行为，让应用在检查点错误后继续运行。

source: You can disable this safety check by adding the -n option
zh_cn: 可以通过在run命令后增加-n选项来禁用此安全检查。

source: You can do this by selecting the job in the web dashboard and clicking on the CANCEL button on the top of the page.
zh_cn: 取消的方式是在Web仪表盘中选定作业，然后点击页面上方的CANCEL按钮。

source: You can do this by selecting the job in the web dashboard and clicking the Cancel button at the top of the page.
zh_cn: 取消的方式是在Web UI中选定作业，然后点击页面上方的Cancel按钮。

source: You can do this by setting the latencyTrackingInterval in the ExecutionConfig as shown here:
zh_cn: 该工作可以像下面这样，通过在ExecutionConfig中设置latencyTrackingInterval来完成：

source: You can either download and extract a source distribution of Flink or clone the Git repository.
zh_cn: 你可以下载并解压Flink源码发行版或将Git仓库克隆下来。

source: You can embed SQL queries into regular Flink DataSet and DataStream programs or directly submit SQL queries to a Flink cluster using the SQL CLI client.
zh_cn: 你可以将SQL查询嵌入到常规的Flink DataSet或DataStream程序中，或使用SQL CLI客户端直接将SQL查询提交到Flink集群上。

source: You can enable and configure the Kerberos support for each service separately.
zh_cn: 你可以单独为每个服务启用和配置Kerberos。

source: You can enable compressed checkpoints and savepoints as follows:
zh_cn: 你可以像下面这样为检查点和保存点启用压缩：

source: You can expect improved support for these scenarios in future versions of Apache Flink.
zh_cn: 你可以期待未来版本的Apache Flink会对这些场景有更好的支持。

source: You can exploit parallelism in dataflow graphs in different ways.
zh_cn: Dataflow图的并行性可以通过多种方式加以利用。

source: You can expose metrics to external backends through report‐ ers and Flink provides implementation for several of them (see Table 10-19 ).
zh_cn: 你可以通过汇报器（reporter）将指标暴露给外部后端，Flink内部为它们提供了几种实现（见表10-19）。

source: You can extend the list by providing a whitelist of classname patterns that
zh_cn: 你可以通过提供类名模式白名单的方式，来扩展优先从父类加载器中解析的类列表（classloader.parent-first-patterns.additional）。

source: You can find more information about the other connectors in the documentation for Apache Flink or Apache Bahir.
zh_cn: 你可以从Apache Flink或Apache Bahir项目的文档中查找更多有关其他连接器的信息。

source: You can follow the instruc‐ tions at the IntelliJ IDEA website to download and install it.
zh_cn: 你可以参照IntelliJ IDEA官网的说明下载和安装它。

source: You can imagine how a precise implementation of this definition can get problematic in practice if we try to track the latency per event in a high-rate streaming job with a complex dataflow.
zh_cn: 但如果想在Dataflow十分复杂的高速流式作业中追踪每个事件的延迟，那么实现精准测量的难度可想而知。

source: You can import the project in your IDE following the steps we described in the previ‐ ous section or you can execute the following command to build a JAR file:
zh_cn: 此时，你可以按照我们在上一节所介绍的步骤把项目导入IDE，也可以执行以下命令来构建一个JAR文件：

source: You can inspect the duration, bytes, and records exchanged, and aggregate those per TaskManager if you prefer.
zh_cn: 你可以查看任务的持续时间、交换的字节和记录数，并根据需求对它们按照TaskManager进行聚合。

source: You can limit the number of connections that read from (input) and write to (output) a filesystem.
zh_cn: 你可以限制读（输入）写（输出）文件系统的连接数。

source: You can look up its implementation in the repository that contains the examples of the
zh_cn: 你可以到本书示例代码库中找到它的具体实现。

source: You can monitor and control the application by accessing the Web UI running a
zh_cn: 你还可以通过运行在http://localhost:8081上面的Web UI来对应用进行监控。

source: You can monitor the constantly produced output using the tail command for example as follows.
zh_cn: 如下所示，你可以使用tail命令监控持续产生的结果。

source: You can pass additional parameters such as the job arguments, the entry class, the default parallelism, a savepoint path, and the allow-nonrestored-state
zh_cn: 你还可以传入一些额外参数，例如作业参数、入口类、默认并行度、保存点路径以及以一个JSON对象形式的allow-nonrestored-state标志。

source: You can pass arguments to the main() method of an application by appending them at the end of the command:
zh_cn: 你可以通过在命令末尾附加参数的方式将其传递给应用的main()方法：

source: You can register a counter metric using the counter(String name, Counter counter) method on MetricGroup.
zh_cn: 你可以使用MetricGroup上的counter(String name, Counter counter)方法注册一个Counter指标。

source: You can show the status of all deployments by running the following command:
zh_cn: 你可以通过运行以下命令来查看所有Deployment的状态：

source: You can shut down a Flink cluster running on Kubernetes by running the following commands:
zh_cn: 你可以运行以下命令来关闭运行在Kubernetes之上的Flink集群：

source: You can specify a FlinkKafkaPartitioner to control how records are mapped to Kafka partitions.
zh_cn: 你可以指定一个FlinkKafkaPartitioner来控制记录如何映射到Kafka的不同分区。

source: You can specify a default filesystem scheme (fs.default-scheme) that is automatically added as a prefix if a path does not provide a scheme.
zh_cn: 如果指定了默认文件系统协议（fs.default-scheme），那么在路径本身不包含协议的情况下，Flink会自动将默认协议作为其前缀。

source: You can specify the default parallelism of
zh_cn: 你可以通过-p参数指定某个应用的默认并行度：

source: You can start a different but compatible application from a savepoint.
zh_cn: 你可以从保存点启动一个不同但相互兼容的应用。

source: You can start an application with the run command of the command-line client:
zh_cn: 你可以使用命令行客户端的run命令来启动应用：

source: You can start the same application on a different cluster.
zh_cn: 你可以在另一个集群上启动相同的应用。

source: You can start the same application with a different parallelism and scale the appli‐ cation out or in.
zh_cn: 你可以用不同的并行度启动原应用，从而实现应用的扩缩容。

source: You can submit an application in detached mode with the -d flag as shown here:
zh_cn: 你可以像下面那样使用-d参数以分离模式提交应用：

source: You can submit an application to a specific master process using the
zh_cn: 你可以使用-m参数将应用提交到特定的主进程：

source: You can then register a >DropWizard histogram in your Flink program using the
zh_cn: 你可以像示例10-7中那样在Flink程序中使用DropwizardHistogramWrapper类注册DropWizard直方图。

source: You can think of keyed state as a key-value map that is partitioned (or sharded) on the key across all parallel tasks of an operator.
zh_cn: 你可以把键值分区状态想象成一个在算子所有并行任务上进行分区（或分片）的键值映射。

source: You can think of state as a local or instance variable that is accessed by a task’s business logic.
zh_cn: 你可以把状态想象成任务的业务逻辑所需要访问的本地或实例变量。

source: You can use a Meter metric to measure the rate (in events per second) at which certain events happen.
zh_cn: 你可以使用Meter指标来衡量某些事件发生的速率（每秒的事件数）。

source: You can use a histogram to represent the distribution of numerical data.
zh_cn: 你可以使用直方图来表示数值类型数据的分布。

source: You can use a savepoint to pause an application and resume it later.
zh_cn: 你可以利用保存点暂停某个应用，稍后再把它启动起来。

source: You can use broadcast state to connect a keyed and a broadcast stream.
zh_cn: 你可以使用广播状态来联结一个按键值分好区流和一个广播流。

source: You can visit Flink’s Web UI at http://localhost:8081 and check the
zh_cn: 你可以通过http://localhost:8081地址访问Flink Web UI并检查相连的TaskManager及剩余处理槽的数目。

source: You can, of course, also configure the state backend in your application, overriding the default values or cluster-wide configuration.
zh_cn: 你当然也可以在应用中对状态后端进行配置，从而覆盖其默认值或针对整个集群的配置。

source: You connect the BroadcastStream with a DataStream or KeyedStream.
zh_cn: 将BroadcastStream和一个DataStream或KeyedStream联结起来。

source: You create a BroadcastStream by calling DataStream.broadcast() and provid‐ ing one or more MapStateDescriptor objects.
zh_cn: 调用DataStream.broadcast()方法创建一个BroadcastStream并提供一个以上MapStateDescriptor对象。

source: You first need to tell Kubernetes to create a port forwarding from the master container to your local machine.
zh_cn: 为此，首先需要让Kubernetes创建从主进程容器到本地机器的端口转发。

source: You have become familiar with the evolution of the open-source stream processing space and you have got a brief taste of what a Flink streaming application looks like.
zh_cn: 你已经熟悉了开源流处理领域的发展过程，且对Flink流式应用有一个粗略的认识。

source: You have learned basic streaming operations and how you can compute meaningful results on unbounded input data using windows.
zh_cn: 你学习了基本的流式操作，并掌握了如何利用窗口在无限输入上计算出有意义的结果。

source: You have probably already noticed that Flink programs are defined and submitted for execution in regular Scala or Java methods.
zh_cn: 你可能已经注意到了，用常规的Scala或Java方法就可以定义和提交Flink程序。

source: You have seen how rolling aggregations encode the history of the whole stream in an aggregate value and provide us with a low-latency result for every event.
zh_cn: 你已经了解滚动聚合是如何将整条历史流压缩成一个聚合值，以及如何针对每个事件在极低延迟内产生结果。

source: You have seen the dataflow programming model and learned how streaming applications can be expressed as distributed dataflow graphs.
zh_cn: 你了解了dataflow编程模型以及如何将一个流式应用表示为分布式dataflow图。

source: You have wondered about the meaning of time in stream processing and you have compared the notions of event time and processing time.
zh_cn: 你思考了流式应用中时间的含义，并比较了事件时间和处理时间的概念。

source: You just installed and started your first local Flink cluster and ran your first Flink DataStream API program!
zh_cn: 恭喜你首次成功安装启动了Flink本地集群并运行了你的首个Flink DataStream程序！

source: You just installed and started your first local Flink cluster and ran your first Flink DataStream program!
zh_cn: 恭喜你首次成功安装启动了Flink本地集群并运行了你第一个Flink DataStream程序！

source: You learned about time-based operators, including Flink’s process functions, built-in windows, and custom win‐ dows.
zh_cn: 你对Flink中基于时间的算子（包括处理函数、内置窗口以及自定义窗口）已经有所了解。

source: You learned the mean‐ ing of time in stream processing and compared the notions of event time and pro‐ cessing time.
zh_cn: 你学习了流式应用中时间的含义，并比较了事件时间和处理时间的概念。

source: You may be able to lower the latency in our coffee shop example by hiring a more skilled barista—one that prepares coffees faster.
zh_cn: 为了降低延迟，可以雇佣更娴熟的咖啡师，他们制作咖啡会更快一些。

source: You may have been able to generate a result earlier but you had to wait for the water‐ mark.
zh_cn: 换言之，你可能早就能够生成结果，但却必须等待水位线来触发。

source: You must not delete a savepoint before another checkpoint or save‐ point is completed.
zh_cn: 请不要在另一个检查点或保存点生成过程中删除保存点。

source: You need to adjust the configuration to successfully run Flink in distributed environ‐ ments.
zh_cn: 如果想让它在分布式环境中运行，你需要调整部分配置。

source: You need to build your own Docker image if you want to adjust some of the parameters.
zh_cn: 如果你想调整某些参数，需要自己构建Docker镜像。

source: You need to configure the number of maximum Appli‐ cationManager restarts in the YARN configuration file yarn-site.xml as shown:
zh_cn: 你需要像下面这样在YARN配置文件yarn-site.xml中配置ApplicationMaster的最大重启次数：

source: You need to manually remove them to free the consumed storage.
zh_cn: 为了释放存储空间，你需要手工删除它们。

source: You need to take a savepoint, cancel the application, and restart it with an adjusted parallelism from the savepoint.
zh_cn: 你只需生成一个保存点，取消应用，然后再将并行度调整后的应用从保存点启动起来即可。

source: You need to use whatever information you have about the sources, the network, and the partitions to estimate progress and an upper bound for the lateness of your input records.
zh_cn: 你需要尽可能地了解有关数据源、网络以及分区等一切信息，以此来估计进度和输入记录的延迟上限。

source: You only have to ensure that the TaskManagers are configured to start their queryable state services as discussed in the previous section.
zh_cn: 你只需要像上节讨论的那样，确保为TaskManager配置了可查询式状态的服务即可。

source: You should carefully revise the configuration of your Kafka setup, paying special attention to the following parameters:
zh_cn: 你需要仔细检查Kafka的设置，特别要留意以下参数：

source: You should not use Flink’s ZooKeeper script for production environments but instead carefully configure and deploy a Zoo‐ Keeper cluster yourself.
zh_cn: 请不要将Flink的ZooKeeper脚本用于生产环境，应该自己仔细配置并部署ZooKeeper集群。

source: You should now be able to browse and inspect the code of the book exam‐ ples.
zh_cn: 你现在应该就能浏览和研究书中示例的源码了。

source: You should see a job listed under “Running Jobs.” If you click on that job, you will see the dataflow and live metrics about the opera‐ tors of the running job similar to the screenshot in Figure 1-9.
zh_cn: 你应该能看到"Running Jobs"列表中有一个作业。点击那个作业，你会看到和图1-9中的截图相类似的数据流程及运行作业中算子的实时指标。

source: You should see a job listed under “Running Jobs”.
zh_cn: 你会发现"Running Jobs"列表中有一个作业。

source: You should see lines as the following ones being written to the file.
zh_cn: 你会看到文件中写入了以下文本行。

source: You should see lines like this being written to the file:
zh_cn: 你会看到文件中写入了和下面类似的文本行：

source: You will also get an introduction to custom, user-defined window operations and core windowing constructs, such as assigners, triggers, and evictors.
zh_cn: 此外你还将了解用户自定义窗口操作以及窗口中的核心结构，例如：分配器、触发器和移除器。

source: You will find the source code in the src/ directory, grouped by chapter:
zh_cn: 你可以在src/目录中找到按照章节组织的源代码：

source: You will learn how to implement a DataStream application and which stream transforma‐ tions, functions, and data types are supported.
zh_cn: 你将从中学到如何实现DataStream应用以及Flink所支持的流式转换、函数、数据类型等。

source: You will learn how to implement custom source and sink connectors and how to implement functions that send asynchronous read or write requests to external datastores.
zh_cn: 你将学到如何实现自定义的数据源和数据汇连接器，以及如何在函数中向外部数据存储发送异步的读写请求。

source: You will learn more about stateful stream processing, failure scenarios, and consistency at the end of this chapter.
zh_cn: 在本章末尾，你将了解更多有关状态化流处理、错误场景和一致性的信息。

source: You will learn more about stateful stream processing, failure scenarios, and consistency in the end of this chapter.
zh_cn: 在本章末尾，你将了解更多有关状态化流处理、错误场景和一致性的信息。

source: You will need to make another attempt at canceling the job.
zh_cn: 你需要再次尝试取消。

source: You would need to build custom Docker images with an adjusted configuration.
zh_cn: 你需要使用调整后的配置构建自定义的Docker镜像。

source: Your service latency is the time you spend in the coffee shop, from the moment you enter until you have the first sip of coffee.
zh_cn: 你的服务延迟就是在店内买咖啡的时间，即从你进门的一刻到抿到第一口咖啡的时间。

source: You’ve seen user-defined functions in action in the code examples of this chapter so far.
zh_cn: 到目前位置，你已经在本章的代码示例中见到过如何使用用户自定义函数。

source: ZooKeeper elects a leader Dispatcher responsible for executing applications.
zh_cn: ZooKeeper会在所有Dispatcher中选出一个负责执行应用的领导者。

source: a ProcessWindowFunction or the result of applying a ReduceFunction, a Process Function memorizes scheduled timers, and some sink functions maintain state about transactions to provide exactly-once functionality.
zh_cn: 举例而言，窗口算子会为ProcessWindowFunction收集输入记录或保存ReduceFunction所产生的结果；ProcessFunction需要记住设定的计时器；一些数据汇函数为了提供精确一次语义需要维护事务相关状态。

source: a WindowAssigner, a trigger decides when to evalute a window, and a window func‐
zh_cn: 触发器决定何时对窗口执行计算，

source: a filter operation that only preserves white squares.
zh_cn: 图5-2展示的Filter操作仅保留了白色方块。

source: a trigger needs to remove all custom per-window state and delete all processing-time and event-time timers using the TriggerContext object.
zh_cn: 触发器的clear()方法需要删除全部自定义的单个窗口状态并使用TriggerContext对象删除所有处理时间和事件时间计时器。

source: a window—when it is created, what information it consists of, and when it is deleted.
zh_cn: 即它何时创建，包含了哪些信息以及何时删除。

source: able field in the open() method or override the Java serialization
zh_cn: 或者覆盖Java的序列化反序列化方法。

source: abort(txn: TXN): Unit aborts a transaction.
zh_cn: abort(txn: TXN): Unit终止给定事务。

source: accesses and fault tolerance in the case of failures.
zh_cn: 又可以支持故障容错。

source: aggregates on a KeyedStream, either with the built-in aggregations functions such as min, max, sum, minBy, or maxBy or with a custom ReduceFunction or AggregateFunc tion, keeps the state for each key and never discards it.
zh_cn: 例如，当我们在一个KeyedStream上计算聚合时，无论采用的是内置聚合函数（例如min、max、sum、minBy或maxBy）还是自定义的ReduceFunction或AggregateFunction，都会为每个键值保存状态并且永不丢弃。

source: all applications that run on the same cluster use the same authentication token.
zh_cn: 在同一集群上运行的所有应用都会使用相同的验证令牌。

source: allows reading and writing values per key—only those keys and values are de/serial‐ ized that are read or written.
zh_cn: RocksDBStateBackend的MapState允许按照每个键对其数据值进行读写，并且只有那些读写的键和数据值才需要进行（反）序列化。

source: also disable any output guarantees.
zh_cn: 但这同样会失去任何输入保障。

source: always add the following import statement to your Scala applica‐
zh_cn: 请确保将以下导入语句添加到你的Scala程序中：

source: and all TaskManager were successfully registered by accessing the Web UI on the machine that runs the master process.
zh_cn: 你可以通过访问主进程所在机器的Web UI来检查主进程的启动以及TaskManager的注册情况。

source: and is the only interface that gives access to operator list union state—the operator state that is fully replicated in the case of a recovery or savepoint restart.3
zh_cn: 并且是唯一可以访问算子联合列表状态（在进行恢复或从保存点启动的情况下需要被完全复制的算子状态）的接口。

source: and provided sources and sinks, Flink’s DataStream API exposes interfaces to register, maintain, and access state in user-defined functions.
zh_cn: 除了内置算子和提供的数据源及数据汇之外，Flink DataStream API也在用户自定义函数里暴露了状态的注册、维护及访问接口。

source: and the onMerge() method needs to implement the logic to perform the merge.
zh_cn: 而相应地需要在onMerge()方法中实现合并逻辑。

source: and when the trigger of the window fires, the aggregated result will be handed to ProcessWindowFunction.
zh_cn: 随后当窗口触发器触发时，再将聚合后的结果传给ProcessWindowFunction。

source: and write data from and to RocksDB, it needs to be de/serialized.
zh_cn: 为了从RocksDB中读写数据，系统需要对数据进行序列化和反序列化。

source: application, fix bugs and repair previously emitted results, migrate an application to a different cluster, or perform A/B tests with different application versions.
zh_cn: 该技术不但可用于失败恢复，还可用于应用更新、Bug修复、结果修正、集群迁移或针对不同版本应用执行A/B测试。

source: apply a ReduceFunction or AggregateFunction to incrementally
zh_cn: 且没有对窗口内容使用ReduceFunction或AggregateFunction进行增量聚合。

source: are moved into the finished state (again by renaming) when the next checkpoint completes.
zh_cn: 在下一次检查点完成后处于等待状态的文件将（通过再一次重命名）进入完成状态。

source: as an identifier for a window, such as the start and end timestamps in the case of a time window.
zh_cn: 例如时间窗口中的开始和结束时间。

source: assignTimestampsAndWatermarks() method where we define the timestamp assigner
zh_cn: 然后调用assignTimestampsAndWatermarks()方法传入时间戳分配器MyAssigner。

source: ately configured, a job submission will fail with a java.io.IOException: Insufficient number of network buffers.
zh_cn: 如果缓冲区数量配置有问题，在提交作业时可能会因异常而失败：java.io.IOException: Insufficient number of network buffers（缓冲区数量不足）。

source: ator does not have an incremental aggregation function, the new element is appended to a ListState that holds all assigned elements.
zh_cn: 如果窗口算子没有配置增量聚合函数，那么新加入的元素会附加到一个用于存储所有窗口分配元素的ListState上。

source: attribute of the records or a round-robin partitioner for even distribution.
zh_cn: 例如，你可以创建一个基于记录键值属性的分区器，或者是可以实现均匀分配的轮询分区器。

source: ature per sensor and the end timestamp of each window.
zh_cn: 为每个传感器每5秒发出一次最高和最低温度以及窗口的结束时间戳。

source: backend and returns it to the requesting client proxy.
zh_cn: 然后将其返回给提交请求的客户端代理。

source: backend maintains application state in the local filesystem.
zh_cn: 最后，RocksDB状态后端会将应用状态维护在本地文件系统中。

source: balancing, retry, and reconnection policies; and provide access credentials.
zh_cn: 定义负载均衡、重试及重连策略，提供访问凭据等。

source: bc0b2ad61ecd4a615d92ce25390f61ad and store the savepoint at hdfs:///xxx:50070/
zh_cn: 你可以使用以下命令取消JobID为bc0b2ad61ecd4a615d92ce25390f61ad的应用并在hdfs:///xxx:50070/savepoints位置生成一个保存点：

source: because the contents of the windows depend on the speed at which the elements arrive.
zh_cn: 这是因为窗口内容取决于元素到达的速率。

source: before deploying Flink: minikube ssh 'sudo ip link set docker0 promisc on'.
zh_cn: minikube ssh 'sudo ip link set docker() promisc on'。

source: beginTransaction(): TXN starts a new transaction and returns the transaction identifier.
zh_cn: beginTransaction(): TXN用于启动一个新的事务并返回事务标识符。

source: between the events of both streams so events of both streams are randomly assigned to operator instances.
zh_cn: 默认情况下，connect()方法不会在两条输入流的事件之间建立联系，因此所有事件都会随机分配给算子实例。

source: birthday: (Int, Int, Int), // year, month, day
zh_cn: birthday: (Int, Int, Int), // 年、月、日

source: boolean sendValues(Iterable<IN> values, long chkpntId, long timestamp) GenericWriteAheadSink calls the sendValues() method to write the records of a completed checkpoint to the external storage system.
zh_cn: boolean sendValues(Iterable<IN> values, long chkpntId, long timestamp) GenericWriteAheadSink会调用sendValues()方法将已完成检查点对应的记录写入外部存储系统。

source: buffers are allocated as off-heap memory, the JVM heap is reduced by that amount.
zh_cn: 由于分配后会以堆外内存的方式使用，所以JVM堆内存会有相应的减少。

source: by visiting http://<jobmanager-hostname>:8081.
zh_cn: 你可以通过地址http://<jobmanager-hostname>:8081访问仪表盘。

source: called for each combination of elements from the first and the second input—the
zh_cn: 算子会遍历两个输入中元素的每个组合（叉乘积）去调用JoinFunction。

source: can be redistributed if a worker node is lost or the application is rescaled.
zh_cn: 还允许在工作节点丢失或应用扩缩容时对状态进行重新分发。

source: can join all A events with all B events that have timestamps between one and two hours more than the A event.
zh_cn: 例如：允许出现B中事件的时间戳相较A中事件的时间戳早1到2个小时这样的条件。

source: canMerge() declares that a trigger supports merging
zh_cn: canMerge()声明了某个触发器支持合并，

source: care, as routing all events to the same task might impact application perfor‐ mance.
zh_cn: 因为将所有事件发往同一任务可能会影响程序性能。

source: cessing because it ensures watermarks are not overtaken by records even if out-of-
zh_cn: 因为即使允许结果乱序，它也能保证记录不会被之后的水位线超过。

source: cessing time and watermark, state stores to manage per-window and per-key global
zh_cn: 当前处理时间和水位线，用于管理单个窗口和每个键值全局状态的状态存储

source: choose the TypeInformation that generates the most efficient serializers and deserial‐ izers.
zh_cn: 此外，某些情况下Flink选择的TypeInformation可能无法生成最高效的序列化和反序列化器。

source: collectWithTimestamp() emits a record with its associated timestamp and
zh_cn: collectWithTimestamp()用来发出记录和与之关联的时间戳；

source: collects all events can become significantly larger than the state of a window whose
zh_cn: 收集全部事件的窗口其状态要大得多。
